# ImportParasolidXT

## Description
Imports the provided Parasolid XT file.

```pascal
FUNCTION ImportParasolidXT(filePath : STRING): BOOLEAN;
```

```python
def vs.ImportParasolidXT(filePath):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|filePath|STRING|The full path to the file to be imported.|

## Version
Availability: from Vectorworks 2020

## Category
* File I@O